{"index": "detect-thoughts", "name": "Detect Thoughts", "desc": ["For the duration of the spell, you can read the thoughts of some creatures. While casting the spell and at your action in each round until the spell, you may focus your mind on a creature you can see 30 feet of you. If the chosen creature has an Intelligence of 3 or less, or if she does not speak any language, the creature is not affected.", "You first read the surface thoughts of the creature, which occupies her mind at that moment. In an action, you can direct your attention to the thoughts of another creature or attempt to deepen your reading thoughts of the same creature. If you deepen your reading, the target must make a backup of Wisdom, otherwise you get access to his argument (if any), in his emotional state and thought that concerns his mind on a broader spectrum Such a concern, love or hate. If successful, the spell ends. In all cases, the target is aware that his mind is under your eyes. Unless you are directing your attention to the thoughts of another creature, the target can use his action turn to roll Intelligence opposite your roll Intelligence. If she has the upper hand, the spell ends.", "The questions verbally directed to the target guide the train of thought. This spell is especially effective during an interrogation.", "You can also use this spell to detect the presence of thinking creatures that are invisible to you. When you cast this spell, or in an action for the duration of the spell, you can find thoughts to 30 feet of you. The spell can override most obstacles but it is blocked by 2 feet stone 2 inches of precious metal, or a thin sheet of lead. You can not detect a creature with an Intelligence of 3 or less or speaking any language.", "After detecting the presence of a creature in this way, you can read his thoughts for the rest of the spell's duration as described above, even if you can not see it, but only if it remains in the range of the spell."], "range": "Self", "components": ["V", "S", "M"], "material": "A copper coin.", "ritual": false, "duration": "Up to 1 minute", "concentration": true, "casting_time": "1 action", "level": 2, "school": {"index": "divination", "name": "Divination", "url": "/api/magic-schools/divination"}, "classes": [{"index": "bard", "name": "Bard", "url": "/api/classes/bard"}, {"index": "sorcerer", "name": "Sorcerer", "url": "/api/classes/sorcerer"}, {"index": "wizard", "name": "Wizard", "url": "/api/classes/wizard"}], "subclasses": [{"index": "lore", "name": "Lore", "url": "/api/subclasses/lore"}], "url": "/api/spells/detect-thoughts"}