{"index": "glyph-of-warding", "name": "Glyph of Warding", "desc": ["When you cast this spell, you enter a glyph that hurt other creatures, either on a surface (like a table or a portion of a floor or wall) or inside an object that can be closed (like a book a parchment or cabinet) to hide the glyph. If you opt for a surface, the glyph can cover an area of 10 feet or less in diameter. If you select an object, it must remain in place. If the object is moved to over 10 feet from where the spell was spell casts, the glyph breeze and the spell expires without being triggered.", "The glyph is virtually invisible and roll Intelligence (Investigation) against the fate of your save DC is required to find out.", "You determine the shutter glyph while casting the spell. For the glyphs inscribed on a surface, the triggers are typically hit or stand on a glyph remove an object placed on the glyph, approach at a certain distance of the glyph or manipulate an object on which is inscribed the glyph. For the glyphs inscribed in an object, triggers are typically open the object, approaching at a distance from the object, seen or read the glyph. Once the glyph is triggered, the spell ends.", "You can refine the trigger conditions so that the spell will work only in certain circumstances or in physical attributes (height or weight), the creature type (eg, only aberrations or the Dark Elves trigger the glyph) or alignment. You can also determine the conditions for certain creatures do not trigger the glyph, using a password, for example.", "When you sign the glyph, make a choice between the explosive runes or glyph fate.", "Explosive runes.", "When triggered, magical energy springs from the glyph in a 20-foot-radius sphere centered on the glyph. The sphere bypasses the corners. Each creature in the area must make a dexterity saving throw or it suffers 5d8 acid damage, lightning, fire, cold or thunder (to be determined during the creation of the glyph). If successful, the damage is halved.", "Sort glyph.", "You can store a level of 3 or less prepared spell in the glyph to chant during the creation of the glyph. The spell must target one creature or area. The stored spell has no immediate effect when spell casts that way. When the glyph is activated, the stored spell spell casts. If the spell is a target, it will target the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell invokes hostile creatures or creates sharp objects or traps, they also appear close as possible to the intruder and attack. If the spell requires concentration, it persists for the duration of the spell."], "higher_level": ["When you cast this spell using a 4 or higher is level, the damage explosive runes increased by 1d8 for each level of top slot 3. If you create a glyph spell, you may store a spell whose level is equivalent or less to spell slot used for the custody of the glyph."], "range": "Touch", "components": ["V", "S", "M"], "material": "Incense and powdered diamond worth at least 200 gp, the spell consumes.", "ritual": false, "duration": "Until dispelled", "concentration": false, "casting_time": "1 hour", "level": 3, "school": {"index": "abjuration", "name": "Abjuration", "url": "/api/magic-schools/abjuration"}, "classes": [{"index": "bard", "name": "Bard", "url": "/api/classes/bard"}, {"index": "cleric", "name": "Cleric", "url": "/api/classes/cleric"}, {"index": "wizard", "name": "Wizard", "url": "/api/classes/wizard"}], "subclasses": [{"index": "lore", "name": "Lore", "url": "/api/subclasses/lore"}], "url": "/api/spells/glyph-of-warding"}